{
  "ENTJ": {
    "name": "生まれつきのリーダー",
    "type": "合理主義気質",
    "character": "指揮官",
    "description": "人を引っ張っていきたいという欲求が強く、幼い頃からグループのリーダーになりたがる傾向が見られます。\n\n将来図を頭の中に描き、そのために人を動かすのが得意です。創意工夫に富む戦略家で、長期に渡る計画を練り、複雑な課題に喜んで挑戦します。すでに確立されたやり方にも敬意は払うものの、より優れている結果が出せるのであれば、積極的に違う方法を試します。必要と判断すれば、他者に負担をかける、非情な決断でも下すことができます。\n\n責任感が強く、意見を伝えるのが得意なため、組織をまとめ上げます。どちらかと言うと厳しい規則がある事を好み、他の人もそれに従ってほしいと考えます。自分に厳しい目標を課すだけでなく、他人にも厳しく接します。能率が悪いことが大嫌いで、同じ間違いが何度も繰り返されると非常に機嫌が悪くなります。\n\n論理的な批評を好み、相手に異議を申し立てる事がよくあります。そして議論をする事で、双方の成長に繋がると考えています。自分を打ち負かす論敵を尊敬し、逆に自分が勝てば他人が正しい見解を身につけたと考えます。\n\n一方で人の気持ちには鈍感で、感情面から相手を説得したり、褒めたり励ましたりするのは苦手です。非論理的な意見を述べる人にはイライラし、上からものを言って怖がらせる事があります。\n\n自分の能力を発揮したい、常に成長したいという思いが強いので自己研鑽に熱心です。 このタイプ特有のエネルギッシュさや、リーダー志向と合わさり、学校、会社などで尊敬される事や出世する事も多いです。\n\nENTJ型は強いリーダーシップを持ち、頭も冴える努力家です。その反面いくつかの欠点を持ちます。\nまず次々と新しい課題に挑戦したいため、物事を早急決めがちです。横暴な独裁者だと思われる事があります。そんな自信満々なENTJに限って経験も能力もない事があります。そして大きな失敗をすると、当の問題よりも自分自身を徹底的に批判したり、感情を爆発させる事があります。",
    "compatibility": {
      "best": "ISFJ",
      "terrible":"ISFJ",
      "good": ["ENFJ","ESFP","INTP","ENTJ","INFJ"],
      "normal": ["ENTP","ESFJ","ISTJ","ENTJ"],
      "special":["ESTP","INFP","ENFP","ISTP"],
      "bad": "INTJ"
    }
  },
  "ENTP": {
    "name": "生まれながらの起業家",
    "type": "合理主義気質",
    "character":"討論者",
    "description":"ベンチャー起業家型の性格です。興奮と挑戦を愛し、創意工夫にとみ、あらゆる可能性を検討します。自分のインスピレーションを信頼しており、アイデアを現実のものにする事で満足感を得ます。多芸多才で融通が効き、頭の回転も速いので、様々な難題に挑んでいきます。問題が困難であるほど、やり甲斐を感じます\n\n分析能力に優れた戦略的思想家です。詮索好きで、物事や人物の欠点をいとも簡単に見つけます。家庭でも職場でも趣味でも「もっと良い方法があるはずだ」と考え、新しい方法を試したがります。また一つの物事を面白がって、賛否両方の立場から議論したりします。\n\n規則だからという理由や、今までやってきたからという理由だけで物事を進めるのを嫌がります。都合が悪い規則やルールがあると、改善しようとしたり、抜け道を見つけようとしたりします。それが無理なら、より自由に動けるように、その場やその組織から逃げ出そうとします。\n\nいつも楽しいことを探しており、毎日違うことが起きた方が刺激的だと思っています。一か八かやってみる方なので、大成功したり大失敗したりとアップダウンが激しいスリルに満ちた人生を送る可能性が高いといえます。\n\n機転が利き、ユーモアのセンスがあるので、社交の場でも活躍します。人から好かれたいという欲求が強く、人の輪の中心にいると気持ちいいので、賢さを誇示したり、際限なく駄洒落を飛ばしたりします。\n\nENTP型は創造性豊かで、興味を持った事ならなんでもこなせる多芸な人です。しかし問題点も抱えています。\nごく普通に行える事があっても、独創的かつ即興的な手法に走る事があります。そのうえルーチンワークや、結果が予想できる作業を嫌うので、当たり前の事実を見落としがちです。きちんと準備をしたり、最後までやり切る事が苦手なうえに、次々と新しい事に手を出そうとするので、大失敗をしたり、無節操で当てにならない人だと反感を買う事があります。また生まれつきせっかちで、早口で話すので他人が口を挟めない事があります。話自体はうまいのですが、ずけずけともの言うので無神経な人だと思われる事もあります。",
    "compatibility": {
      "best": "ISFP",
      "terrible":"ISFJ",
      "good": ["ENTP","ESFJ","INTJ","ESTP","ISTP"],
      "normal": ["INFP","ESFP","ENTJ","ENFP"],
      "special":["ENFJ","ISTJ","ESTJ","INFJ"],
      "bad": "INTP"
    }
  },
  "INTJ": {
    "name": "アイデアマン",
    "type": "合理主義気質",
    "character":"建築家",
    "description":"独創的な完璧主義者です。独自のアイデアや仕組みを考え、高い目標に向かって邁進します。他人から批判されたり無関心な態度をとられても、他のタイプほどは気にしません。「我が道を往く」を体現したかのような性格です。\n\n凝り性で何でも完璧したいので、仕事でも遊びでも、もっと良い方法があるはずだと改善策を考えます。自分自身を向上させるのも好きで、知識の習得に熱心です。\n\n理論肌で、感情より理性を信頼しています。また戦略的思考も得意で、長期的展望や物事の裏側を予測します。アイデアが役に立つかは事前によく検討するものの、一度着想を得ると、１つの目標に向けて突っ走る傾向があります。\n高い目標を掲げるうえに、凝り性、そして長期的な視点も持ち合わせているため、大きな成果を達成する事もあります。\n\n自分のアイデアに自信を持っていますが、他者の考えや意見の方が筋が通っていると思えば、乗り換えます。しかし納得ができなければ、社会の常識とされているものであっても受け入れません。\n\nふっと考え事の世界に行ってしまい、周りを見ていない事が多いので、事故にあったり、服を前後逆に着たまま出かけないように注意が必要です。\n\n社交的な会話は苦手で、一人でいる事を好み、あまり感情を表には出しません。また他人に対しても、自分が頑張るのと同じぐらい頑張らせようとしたり、他人の望みや意見を無視する傾向があるため、冷たく、よそよそしい人と思われる場合があります。しかし、自分が好きな人や信頼している人からの拒絶は恐れており、感情的に傷つきやすい面もあります。\n\n優れた長所を持つINTJ型ですが、諸刃の剣というべき欠点も持ち合わせています。\nまず高い目標に向かって努力するのが当然だと思っているので、他人にも目標達成を求めますが、どれぐらい苦労するかなどお構いなしで自分の基準で判断します（そもそも他人に期待しない事もある）。他人の批判を気にしないのはタフだと言えますが、それが災いして人の意見を深く考慮せずに跳ねつける事もあります。さらに細かい事実を見落としがちなので、せっかく考えたアイデアが非現実的な物になっている事があります。",
    "compatibility": {
      "best": "ESFJ",
      "terrible":"ESFP",
      "good": ["ENTP","ISFP","INTJ","ENFJ","INFJ"],
      "normal": ["ISTJ","INTP","ISFJ","ESTJ"],
      "special":["ESTP","INFP","ENFP", "ISTP"],
      "bad": "ENTJ"
    }
  },
  "INTP": {
    "name": "独創的に問題を解決する人",
    "type": "合理主義気質",
    "character":"論理学者",
    "description": "一見物静かでぼーっとしていますが、頭の中では常に思考をこねくり回しています。何でもかんでも分析する癖があり、自分一人で「ああでもないこうでもない」と考えている時が幸せです。\n\nふっと考え事の世界に行ってしまい、周りを見ていない事も多いので、事故にあったり、服を前後逆に着たまま出かけないように注意が必要です。\n\n知識欲がとりわけ強く、本の虫のような人が多くいます。自分の知性に自信を持っており、もっとを才能を伸ばしたいと思っています。\n\n独創的かつ論理的な考え方をします。 とりわけ物事の本質を見極めたり、難しい抽象的な問題を考えるのが得意です。\n\n既存の定説に対して疑い深く、今の状況を改善したり新しい論理モデルを作りたいという情熱を持ちます。\n\n的確なコミュニケーションを重んじ、長々しい話を好みません。ただし自分の専門分野や興味がある事を親しい人に話す時は、おしゃべりになります。また思考や論理の中の矛盾を発見するのが得意で、議論中の発言は正確で鋭いです。\n\n危機に瀕しても冷静で、困難に直面すると大いにやる気を出します。ところが簡単な事はすぐに飽きてしまい、雑事や細かい事には注意を向けないので、傲慢に見える事もあります。\n\nINTP型は向上心に燃える優れた理論家ですが、欠点もあります。\nまず第一に、社交が苦手な傾向があります。自分の感情を口頭で伝えたり、世間話をするのが難しく感じます。また他人の感情や欲求に鈍感です。\n自分より頭の悪そうな人間を軽視する事があり、知らず知らずのうちに周りから敵対心や警戒感を持たれる場合があります。\n自分の仕事に間違いや欠点があると、そこばかりに注意が向いてしまい最後までやり遂げる事ができない事があります。また完璧、有能、優秀でありたい思いが強すぎるため、時に無力感に襲われストレスを抱えます。",
    "compatibility": {
      "best": "ESFP",
      "terrible":"ESFJ",
      "good": ["ESTP","INTP","ENTJ","ISFJ","ISTP"],
      "normal": ["ISFP","INTJ","INFP","ENFP"],
      "special":["ENFJ","ISTJ","ESTJ","INFJ"],
      "bad": "ENTP"
    }
  },
  "ISTP": {
    "name":"危険やスリルを求める人",
    "type": "職人気質",
    "character":"巨匠",
    "description": "１６タイプの中で最も実務的な性格です。何事も客観的に判断し、冷静沈着。危機に直面すると、迅速に問題を解決します。道具、機械、楽器などを扱うのが得意な人が多く、手先も器用な人が多いです。\n\n事実を観察して、心の中で分析・評価する事に自然と関心が行きます。そのため現実的で勘が良く、最小限の努力で最大の成果を上げます。すぐに活用できない抽象的な理論や無駄な会議には興味を持ちませんし、面倒な規則は無視ようとします。そして新鮮で具体的な課題に挑戦する事を好みます。\n\n生来の一匹狼で、人にあまり関心を持ちません。自分の感情を他人と分かち合うのが苦手で、またそんな事をする必要もないと考えています。聞き手に回る事が多くあまり異議をとなえないので、賛成しているのかと思われる事もあります。しかし実際は発言しないだけで自分なりの考えを持っています。大抵は静かで控えめですが、自分がよく知っている事に関してはお喋りになる場合もあります。\n\n学校や職場では一匹狼に見えるISTP型ですが、趣味仲間を作るのは好きです。その場合、たとえ会話はなくても趣味における道具、行動を通して友情を育みます。また誰に対しても平等であり、気前がいい面もあります。\n\n仕事でも私生活でも、活動的で危険な事をしていると元気になります。野外活動やスポーツを好む人が多く見られます。強風時に外に出たくなったり、ゲームでスリルを楽しむ人も多いはずです。余談ですが、この性格型は「武装型」と呼ばれる事があります。消防士やパイロット、狙撃兵、スポーツ選手のような、危険が伴う仕事や武器を扱うプロフェッショナルに、ISTPが多いためです。\n\nISTP型の冷静で臨機応変な点は大きな強みです。しかし次のような弱点も持っています。\n自由時間が欲しいので最低限の事しかやらない傾向があります。できるだけ近道をしたい、無駄な努力をしたくないという感情が強すぎるためです。臨機応変で常に新しい情報を集めようとするので、優柔不断で煮えたぎらない所があります。また人間関係には弱く、ちょっとでももつれると責任から逃れようとします。",
    "compatibility": {
      "best": "ENFP",
      "terrible":"ENFJ",
      "good": ["ENTP","INTP","ESTJ","INFJ","ISTP"],
      "normal": ["ISFP","ISTJ","INFP","ESFP"],
      "special":["ESFJ","INTJ","ENTJ","ISFJ"],
      "bad": "ESTP"
    }
  },
  "ISFP": {
    "name": "調和を願う職人",
    "type": "職人気質",
    "character":"冒険家",
    "description":"会話や文章表現にあまり関心がなく、他人に影響力を発揮したいとも思わず、趣味なども親しい人以外にはなかなか見せないので、最も影が薄い性格型と言えるかもしれません。\n\nしんぼう強くて柔軟性があり、他人の気持ちを察するのも得意なので、大抵の人とはうまく付き合えます。ただ多くの人と積極的に付き合うと言うよりは、家族や、少数の仲の良い人といっしょにいる事を好みます。特に時間をかけて自分の内面を理解してくれる人とは親しくなります。\n\nあまりリーダーシップを取ろうとは考えておらず、代わりに他者を見守ったりサポートに回ります。また人に対する思いやりを言葉より、行動で示そうとします。\n\nいま生きることを楽しみ、その瞬間瞬間を味わいます。そのため、やりたいと感じた事を、すぐに、満足するまでやろうとします。何に興味を持つかは人それぞれですが、絵、音楽、料理、体を動かす事など、目で見て、耳で聞き、体で感じる活動を好みます。一旦活動しだすと、脇目もふらず熱中する事もあります。また自然や、田園風景、動物、子供などに対して、他のタイプより高い関心を示す事が多いようです。これらの特性により、芸術家や職人として活躍している事もあります。\n\n短期的な計画は立てますが、長期的な計画を立てるのは苦手です。広い視野で物事を見たり、前もって準備する気になかなかなれません。また整理整頓も苦手です。\n\nISFP型の職人芸、人を思いやる性格は大きな美点ですが、同時に弱点でもあります。\nというのも他人の問題につい首を突っ込みすぎたり、自分のやりたい事より相手の願いを叶える事に懸命になってしまう事があるからです。こうなると心身によくないので、もっと自分自身の要求を主張するようにしましょう。また人をあまり疑わないため、話術に長けた悪人に騙されてしまう危険があります。",
    "compatibility": {
      "best": "ENTP",
      "terrible":"ENTJ",
      "good": ["ISFP","ESFJ","INTJ","INFP","ENFP"],
      "normal": ["ESTP","INTP","ISFJ","ISTP"],
      "special":["ENFJ","ISTJ","ESTJ","INFJ"],
      "bad": "ESFP"
    },
  },
  "ESTP": {
    "name": "いつも忙しい冒険家",
    "type": "職人気質",
    "character":"起業家",
    "description": "いつも慌ただしい生活を送っている活発な人です。好奇心旺盛で、遊ぶのが大好きで、後先考えずに行動します。意外なできごとが大好きで、複雑すぎない事や感情的に緊張しない事なら何でも首を突っ込みたがります。他の人からは、「異常に活発だ」とか「落ち着きがない」と思われる事もしばしばあります。\n\nアウトドアやスポーツが好きな事が多いです。早業などを真似したがり、危険なことも省みません。運動神経がよく、興味を持った事にはすぐに夢中になり、多趣味です。体を動かす活動以外では、おしゃれ、食事、機械いじりなど、五感で楽しめる活動を好みます。\n\nリスクを冒してでもスリルを求める傾向にあります。逆につまらない単調作業の繰り返しや、一箇所でじっとしている事に苦痛を感じます。また暗い話題は苦手で、そういった場からは逃げ出そうとしたり、話をそらします。\n\nお喋りで社交的です。特にジョークが得意で、場の雰囲気に合わせて際限なく面白い話を考えます。気前が良く、社交術も心得ている事が多いため、友人は多い方です。また人を説得するのも得意で、人柄の良さだけでなく、理論やアイデアで納得させる事もできます。\n\n新しいものを好む実務家で、論理的に分析するほか柔軟に方向転換します。無駄だと思ったことはすくに止めます。面白くなければ読んでいる途中の本もすぐに投げ出しますし、部屋の片付けも時間がもったいないので乱雑です。慣れ親しんだものでも飽きると、すぐに新しいものに飛びつきます。やっている最中の仕事を放置して新しい事を初めてしまう事もありますが、集中量はかなりのものなので土壇場で何とか仕上げます。\n\n論理的なので時に客観的な見地から厳しい判断を下しますが、基本的には押し付けがましくない方です。何事も柔軟に対処し、自分にも他人にも寛容だからです。\n\nESTP型の新しい物好きで活発な所は大きな長所ですが、周りの人に迷惑をかける時もあります。\nたいした考えもなく突発的に行動し、予期せぬ危機に巻き込まれると大騒ぎします。社交的なので周りの人も巻き込んで大混乱に陥らせます。仕事でも決められた手順を無視して自己流で処理するため、トラブルメーカーぶりを発揮します。遊び好きで外見を派手にする傾向があるので、傲慢な人間に見られたり、敬遠されてしまう事もあります。誠意ある会話を長時間続ける忍耐力もないため、浮ついた会話も多くなりがちです。",
    "compatibility": {
      "best": "INFP",
      "terrible":"INFJ",
      "good": ["ENTP","ENFJ","ISTJ","ESTP","INTP"],
      "normal": ["ISFP","ESFP","ESTJ","ENFP"],
      "special":["ESFJ","INTJ","ENTJ","ISFJ"],
      "bad": "ISTP"
    },
  },
  "ESFP": {
    "name": "楽しい事が好きな人",
    "type": "職人気質",
    "character":"エンターテイナー",
    "description":"人と一緒にいるのが好きで、日常生活そのものに楽しみを見出します。純粋に楽しい事が好きで、他者が楽しめるように工夫する事にやり甲斐を感じます。\n\n他人を受け入れたいので、自分の意見を押し付けません。機転がきき、思いやりもあるので、多くの人に満遍なく好かれます。ただし不和を嫌うので、無神経な人とは付き合いたくないと考えています。\n\n現実的で物事をありのままに見たり、感じたりします。理論的な見解よりも、自分の五感で感じた事を信頼します。集めた情報から解決策を見出すのが得意なほか、特に人に関する細かい事をよく覚えています。\n\n自分の外見に誇りを持っている人が多く、健康で魅力的な体を維持するために努力します。人との出会い、美味しい食べ物、おしゃれ、動物、自然など、様々な新しい経験に胸を踊らせますが、一箇所に腰を落ち着けるのは苦手です。自由奔放なところがありますが、他人との対立は望んでいないので、無駄な波風を立てるぐらいなら、従うべきところでは素直に従う事が多いです。\n\n心配事には最も耐えられないタイプで、暗い話題や不安は忘れるか、見てない事にしようとします。\n\nESPF型は一度しかない人生を愉快に楽しむ事でしょう。しかしその性格ゆえに、不快な事件に遭遇する事もあります。\nまず計画を立てるのが苦手なので、避けられたはずの厄介事に巻き込まれます。また誰かを喜ばせたいあまり、論理的妥当性よりも感情を重視する事があります。人の長所ばかり見て失望したり、悪い人に騙される事もしばしばです。誘惑に弱く、自分を律するのが苦手という問題もあります。",
    "compatibility": {
      "best": "INTP",
      "terrible":"INTJ",
      "good": ["INFP","ESFP","ENTJ","ISFJ","ENFP"],
      "normal": ["ENTP","ESFJ","ESTP","ISTP"],
      "special":["ENFJ","ISTJ","ESTJ","INFJ"],
      "bad": "ISFP"
    }
  },
  "ISTJ": {
    "name":"一人コツコツ努力する人",
    "type": "保護者気質",
    "character":"管理者",
    "description": "真面目で責任感がある性格です。組織や家族など親しい人への忠誠心が強く、自分が言った事に責任を持つので信頼されます。また一度や決めたことは、困難に遭遇しても最後までやり通そうとします。\n\n実践的な事を重視し、物事の細部までよく覚えており集中力もあります。そして自分の経験から的確に判断を下します。論理的で客観的なので、時に非情な決断を下す事もあります。また周囲の感情に気を配らないため、冷たい人だと思われる事もあります。\n\n何事も予定を立てて順番にこなして行くので達成率は高いのですが、周りにそうしない人がいるとイライラします。一度たてた計画を変更させらそうになると頑固に抵抗します。またリスクを取る事は好まず、慎重で保守的です。未知の物や、社会一般に承認されていない説を疑います。\n\n未来の可能性にかけるより、今起きている事にひたむきに取りくみたいと考えています。ISTJが新しい方法を取り入れるのは、成果が出ると事実から証明された時です。あくまでも実践的ですぐに役に立つ事が大切なのです。\n\n一人でいる事を好み、他者から指図されたり、人の助けを借りたいとは思いません。一人コツコツ作業するのが性に合っています。\nただし必要性が感じられ、役割と責任範囲が明確ならグループ活動にも積極的に参加します。そのため社交的な性格と勘違いされる事もあります。特にISTJ型の男性の場合は、同性の友人やグループで活動する事を好みます。\n\n無駄遣いは嫌いで、何かを買う時は、見た目よりも実用性を重視します。約束を守らない人、オーバーなしゃべり方をする人や、派手で贅沢な人などには、内心眉をひそめます。\n\n \n\nISTJ型の真面目で論理的、初心貫徹の精神は大きな美点です。しかし苦手な事もあります。\nまず日々の細かい作業に没頭しがちなため、大局を見るのが苦手です。変化に対応するのも難しく感じるかもしれません。また自分の見解とは異なる説を一方的に拒んだり、人の感情を考慮せず意見を主張する傾向もあります。",
    "compatibility": {
      "best": "ENFJ",
      "terrible":"ENFP",
      "good": ["ESFJ","ISTJ","ESTP","INFP","ISFJ"],
      "normal": ["INTJ","ENTJ","INFJ","ISTP"],
      "special":["ENTP","ISFP","ESFP","INTP"],
      "bad": "ESTJ"
    }
  },
  "ISFJ": {
    "name": "サービスマン",
    "type": "保護者気質",
    "character":"擁護者",
    "description": "忠誠心が強く、勤勉でひたむき、おもいやりもある性格で、人の役に立ちたいという願望があります。特に目の前に困っている人、助けが必要な人がいると、手を差し伸べたくなります。\n\n大量のデータを扱うのが得意で、物事の細部まで正確にこなす集中力があります。人の声や表情、名前などをよく覚え、繰り返しが多い単調作業への耐性も高いです。そして必要な事であれば、困難にぶつかっても最後までやり通します。一方で想定外のできごとは苦手なので、何事も計画通りに進まないと安心できません。休日の過ごし方でさえ、計画をたてて管理します。\n\n人と交流するときは暖かく接します。といっても社交家ではなく、一人でゆっくりしたり、家族や少数の親友と過ごすことを好みます。物静かで自分の感情が揺れ動いている時でも、気持ちを打ち明ける事はあまりありません。ただ、そういった深い所にある感情を理解してもらえると嬉しく感じます。\n\n浪費や、身の丈にあっていない派手な生活は嫌いです。派手で金遣いの荒い人よりも、静かで控えめな相手を友人として選ぶことの方が多いようです。\n\nISFJ型の真面目でサービス精神溢れる所は大きな美点です。しかしそれ故困った事も起きます。\nまず自分の欲求より、家族や友人の願いを優先してしまう事があります。押しが強い人につけ込まれて、何かと頼まれごとをされる事もあります。これでは幸せになれません。また細かい作業に強く労をいといませんが、うっかりすると日々の単調な作業にはまり込みヘトヘトになってしまいます。さらに周到に計画を練るわりには、将来を見通すのは苦手なので、努力した割には報われない事もあります。",
    "compatibility": {
      "best": "ENTJ",
      "terrible":"ENTP",
      "good": ["ISTJ","ESFP","INTP","ISFJ","ESTJ"],
      "normal": ["ISFP","INTJ","ENFJ","INFJ"],
      "special":["ESTP","INFP","ENFP","ISTP"],
      "bad": "ESFJ"
    }
  },
  "ESTJ": {
    "name": "責任を果たす人",
    "type": "保護者気質",
    "character":"幹部",
    "description": "責任感があり、何事も最後までやり遂げようとする性格です。計画性があり、きちんとスケジュールを立て、予定通り仕事や勉強を進めます。\n\n経験的に習得した事から明確な基準や信条を持ち、首尾一貫した態度をとります。えこひいきしたり、気まぐれに行動を起こさないので周りから信頼されます。\n\n陽気で人づきあいが好きなので、初対面の人とでもすぐに打ち解けられます。伝統行事や家族との時間も大切にします。しかし他人との感情的な繋がりはあまり重視していません。相手が嫌な思いをしようが率直に批判する事もできますし、決められたルールに従うように強いる事もあります。家庭でも職場でも、自分のいいなりになる人間に囲まれている事を好みます。\n\nピラミッド型の命令系統を持つ、伝統的な組織に強く惹かれます。権威と規則を尊重し、革新よりも現状維持を望みます。いずれ自分も権威ある地位に登り詰め、上から命令をくだしたいと思っています。競争心旺盛で、自分を売り込むのが得意なので、実際こういった地位に付く事がよくあります。\n\n規則や社会的常識を重視し、これらを守らない人に対しては怒りを爆発させる事もあります。ただし自分自身はルールをきちんと守り、義務や責任も全うしようとします。\n\n実用性を尊重するので、経営や機械工学などに関心を抱く事があります。一方で漠然としたアイデアにはあまり興味を示しません。\n服装も実用性重視で、小奇麗でシチュエーションにあった服を着が好みです。奇抜なファッションや流行を追い求める事はなさそうです。\n\n \n\nESTJ型は組織人として大変すぐれた点を持っていますが、弱点もあります。\nまず自分の考えが正しいと信じ、価値観を押し付けたがります。そして相手の感情を考慮せず批判するので、人を傷つけます。また慣れ親しんだものや昔からの方法を好み、将来を予想するのが苦手なので、急な変化に対応できません。その結果、頑固で無神経、視野が狭い人間と思われる事があります。このような点を改善すれば、さらなる出世が期待できます。",
    "compatibility": {
      "best": "INFJ",
      "terrible":"INFP",
      "good": ["ESFJ","ISFJ","ESTJ","ENFP","ISTP"],
      "normal": ["INTJ","ENFJ","ENTJ","ESTP"],
      "special":["ENTP","ISFP","ESFP","INTP"],
      "bad": "ISTJ"
    }
  },
  "ESFJ": {
    "name": "思いやりにあふれた社交的な人",
    "type": "保護者気質",
    "character":"領事官",
    "description": "親しみやすく、話好きの社交家です。良好な人間関係を築きたいと強く願っており、そのために懸命に努力します。人の力になれるのなら、面倒な事もいといません。特に誰かが困っている時や、祝い事がある時に手を貸せると、大きなやりがいを感じます。「まさかのときの友こそ真の友」を体現したかのような性格です。\n\n家族や友人を大切にするのはもちろん、地域活動やボランティアにも協力的です。人の役に立てるのが嬉しいだけでなく、常に社会との繋がっていたいためです。\n\n実務家でもあり、重要な事実やデータによく気づき、細かいところまで覚えています。そして他人にも、どんな小さい事でもおろそかにせず、真面目にやってもらいたいと期待します。\n\n五感を信頼しているので、体を動かすのが好きで活動的です。手芸や木工など手先を使う作業も好む傾向があります。また物を所有する事に喜びを感じ、大切に扱います。\n\n伝統を重んじるため、昔から慣れ親しんでいるものに惹かれます。逆に慣れない事や、新しい事に挑戦するのは苦手です。車を運転する時は、気まぐれに普段と違う道を通りたいとは思わないでしょう。\n\n四角四面な所があり、何事も整然と予定通りに進まないと気がすみません。家の中は常に綺麗に片付け、読書や遊びも予定を立ててきちんと実行します。家族に対しても、それぞれの役割を守るように期待します。期待が破られると腹を立てたり、傷つきます。\n\nESFJ型の人に尽くすので、周りから愛されます。しかしそれが原因でストレスをため込む事も少なくありません。人から愛され、必要とされ、評価される事を望んでいるので、批判されたり無関心な態度をとられると、いとも簡単に傷つきます。また誰かの役に立ちたいと必死になるあまり、自分の意見を声高に主張し、横暴な人だと思われたり、余計なお節介だと迷惑がられる事もあるのです。",
    "compatibility": {
      "best": "INTJ",
      "terrible":"INTP",
      "good": ["ENTP","ISFP","ESFJ","ISTJ","ESTJ"],
      "normal": ["ENFJ","ESFP","ENTJ","INFJ"],
      "special":["ESTP","INFP","ENFP","ISTP"],
      "bad": "ISFJ"
    }
  },
  "INFP": {
    "name": "人生の意味を追い求める者",
    "type": "理想主義者気質",
    "character":"仲介者",
    "description": "心の調和を大切にし、自分の価値観にあった生き方を追求する理想主義者です。\n\n想像力豊かで偏見がなく、好奇心旺盛。洞察力に優れ、長い目で物事を見ることができます。夢や理想に懸命に取り組むほか、芸術や新しい概念に惹かれます。\n\nものごとを一気にやり遂げる傾向があり、自分が打ち込んでいる事に深く集中し、大きな成果をあげます。また言葉で語るより、文章で表現するのが得意です。一方であまり意味が感じられない作業や、単純作業の繰り返しは嫌いです。\n\n控えめで、自分の気持を打ち明ける相手を慎重に選びます。そのため周りからは、よそよそしい、無口で内気などと見られる事があります。しかし本当は誠意があり、とても思いやり深い人間です。\n\n人の感情を敏感に感じ取って心から共感し、相手の事を深く理解しようとします。表面上のつきあいは好きではありませんが、自分の価値観を時間をかけて理解してくれる人は、宝物のように大切にします。\n\n人を支配したり威圧したいとは考えず、所有物や物理的な環境にも、あまり関心を払いません。ところが自分の理想や信念が脅かされると、とたんに周囲に合わせることを止めます。そして普段は考えられないぐらい激しく、自らの価値判断を訴えかけます。\n\nINFPの理想に向かって努力する所は美点ですが、問題もあります。\n理想を追い求めるあまり、時に実現不可能なほど高い目標を自分に課してしまいます。その結果、無力感と激しいストレスに襲われる事があります。また感受性が強いので、相手が批判的に言ったつもりでない事にも傷つきます。そして相手と話し合いをする事なく、怒りと悲しみを自分の中に押し込み、その人とはつき合わないようにして処理してしまいます。全性格中、最も根に持ちやすい傾向があるので注意が必要です。",
    "compatibility": {
      "best": "ESTP",
      "terrible":"ESTJ",
      "good": ["ISFP","ENFJ","ISTJ","INFP","ESFP"],
      "normal": ["ENTP","INTP","INFJ","ISTP"],
      "special":["ESFJ","INTJ","ENTJ","ISFJ"],
      "bad": "ENFP"
    }
  },
  "INFJ": {
    "name": "信念を持った理想家",
    "type": "理想主義者気質",
    "character":"提唱者",
    "description": "やや頑固ではありますか、自分の理想を叶えたい、誰かの役に立ちたいという強い願望を持っています。相手の感情や関心を理解するのが得意で、周囲の人間全員の利益を考えます。表立って人を引っ張っていく事は少ないものの、目立たない所で影響を与える事が多いタイプです。\n\n何よりも自分の価値観を重視しており、世間一般の定説を気にしません。批判されたり忠告されても、そう簡単には意見を変えません。控えめながら押しが強く、自分の意見を受け入れてもらうためにはゴリ押しも辞さない事があります。ただ権威を押し付けたり、論破しようとするよりも、相手を認めたり褒めたりする事で協力を得ようとします。\n\nじっくり考えた上で決断を下し、トラブルが起きると逆に奮起します。いろいろな事に同時に取り組むのではなく、１つの事をじっくりやるのを好みます。そして創造性と洞察力に優れるので、物事の深い所にある意味を読み取ったり、新しいアイデアを考えるのが得意です。\n\n複雑で豊かな内面を持っていますが、自分の考えを親しい人にしか伝えず、比喩や複雑な表現を好むので、よく分からない人と思われる事が多くあります。\n全タイプ中、最も直感力に優れており、その傾向が極端な場合、他人の考えている事や、良い点、悪い点などを瞬時に察知してしまうがあります。 著名な霊能者や宗教家には、このタイプが多いと考えられます。\n\n多くのINFJ型は有能ですが、いくつか苦手な事があります。\nまず独創的なアイデアは浮かぶのですが、それを実行に移す過程を楽しむのが苦手です。繊細過ぎるところがあり、他人からの批判で簡単に傷ついてしまいます。また物事の全体像を把握するのが得意な反面、細々とした事実は軽視する傾向があります。そして自分のアイデアに自信を持ちすぎており、柔軟さを欠き頑固です。",
    "compatibility": {
      "best": "ESTJ",
      "terrible":"ESTP",
      "good": ["INTJ","ENTJ","INFJ","ENFP","ISTP"],
      "normal": ["ESFJ","ISTJ","INFP","ISFJ"],
      "special":["ENTP","ISFP","ESFP","INTP"],
      "bad": "ENFJ"
    }
  },
  "ENFP": {
    "name": "好奇心豊かな社交家",
    "type": "理想主義者気質",
    "character":"広報運動家",
    "description": "想像力豊かで柔軟に物事を判断するので、何よりひらめきを重視しています。常識にとらわれないので、既存のやり方を打ち破ったり、新しいものの見かたを考えるのが得意です。独創的なアイデアが閃くと、後先考えずついやってみたくなります。そして自分のユニークな所に自信を持っています。\n\n人づきあいが大好きで、誰かと一緒にいると元気になります。思いやりがあり、困っている人がいると助けたくなります。熱意があり、人当たりも良いため多くの友人に恵まれます。誰かと協力して物事をやり遂げるのも得意です。\n\n好奇心旺盛で、実にいろいろな事に興味を持ちます。あらゆる可能性に心を開いており、「ここまで」と線引せずに新しい情報をどんどん取り込みます。将来を見通すのが得意なうえ、平凡な事実から他者では見抜けないような意味を発見する事もあります。\n\n何かトラブルが起きると刺激的だと感じて、余計はりきります。問題解決にあたっては型にはまらず、時に権威や規則を無視してでも前進します。楽天的で、大抵の事はなんとかなると思っています。逆に思った通りにいかないと、不思議に感じてしまいます。\n\n複雑で繊細な内面を持っており、人の役に立つ事や、感謝される事は好きなのに、人から頼られると重荷を感じる場合があります。また喜怒哀楽など強烈な感情を経験する事は大切だと思っている一方で、実際に経験すると居心地の悪さを感じたりします。\n\nENFP型は人づきあいが得意で独創的ですが、いくつか弱点もあります。まず何でもかんでも興味を持つので、手を広げすぎて収拾がつかなくなる事があります。また地道な作業より、その場で即興的に考えるのが好きで、計画を立てようとしません。その上あきっぽいので、やらないといけない事を途中で放棄する事があります。細かい事にはうとく、集中力が必要な作業も苦手です。人の心の動きを察知するのが得意なものの、言動を深読みしすぎる癖があり、外すこともまた多いです。これは直感的な思い込みと一致する情報を重視してしまうためです。\n\n余談ですが、アニメや漫画の主人公ではこういった性格のキャラが多くみられます。",
    "compatibility": {
      "best": "ISTP",
      "terrible":"ISTJ",
      "good": ["ISFP","ESFP","ESTJ","INFJ","ENFP"],
      "normal": ["ENTP","ENFJ","ESTP","INTP"],
      "special":["ESFJ","INTJ","ENTJ","ISFJ"],
      "bad": "INFP"
    }
  },
  "ENFJ": {
    "name":"人の幸福を願う人",
    "type": "理想主義者気質",
    "character":"主人公",
    "description": "人の気持ちが良く分かり、人を幸福にしようと努力します。はっきり物を言い、陽気で活発。コミュニケーション能力が高く、１対１でも集団でも人間関係を円滑に運びます。どちらかと言えば、文章で伝えるよりも対面で話す方が得意です。\n\n自分の理想や価値観を大切にするので、尊敬する人には忠義を尽くし、組織の一員として真面目に働きます。規律を守って暮らすのが好きなため、他人にも秩序や約束を守ってほしいと思っています。\n\n自分に厳しい一方、他人には優しく、あまり相手を批判しません。ただ自分の献身的な働きが認められる事にやり甲斐を感じるため、逆に他者から批判されると過敏に反応する事があります。\n\n複数のことを同時に進めるのが得意で、事前に立てた計画を人と協力して進めたいと思っています。人が成長する過程に大きな満足感を得るので、部下や生徒の能力を伸ばすのがうまく、また相手の良い点を発見するのが上手です。\n\n将来の可能性に目を向け、集団を盛り立て、成長させていくので、時にカリスマ的なリーダーとみなされます。\n\nENFJ型のリーダーシップがあり、思いやりに溢れる所は大きな美点ですが、問題もあります。\n人に同情しすぎる傾向があるので、つい他人の問題に深入りし、エネルギーを消費してしまいます。そういった事が度重なると意気消沈して、引きこもってしまったりします。また人や状況を理想化して見てしまう事があり、後で都合が悪い事が分かっても信じたくないため、問題を先送りにする事があります。せっかちな所があり、今の仕事を終わらせて、すぐに次の仕事にとりかかりたいと考えています。急いで終わらせるために、必要な情報収集を怠り、慌てて結論を出すこともあります。",
    "compatibility": {
      "best": "ISTJ",
      "terrible":"ISTP",
      "good": ["INTJ","ENFJ","ESTP","INFP","ENTJ"],
      "normal": ["ESFJ","ISFJ","ESTJ","ENFP"],
      "special":["ENTP","ISFP","ESFP","INTP"],
      "bad": "INFJ"
    }
  }
}